import requests 

# ----- Get surah_list_ar and surah_list_en -----
# URL = 'http://api.alquran.cloud/v1/surah'
# r = requests.get(url = URL)
# surah_list = r.json()
# data = surah_list['data']
# surah_list_ar = []
# surah_list_en = []
# for s in data:
#     surah_list_ar.append({s['number']: s['name'] })
#     surah_list_en.append({s['number']: s['englishName'] })

surah_list_ar =  [{1: 'سُورَةُ ٱلْفَاتِحَةِ'}, {2: 'سُورَةُ البَقَرَةِ'}, {3: 'سُورَةُ آلِ عِمۡرَانَ'}, {4: 'سُورَةُ النِّسَاءِ'}, {5: 'سُورَةُ المَائـِدَةِ'}, {6: 'سُورَةُ الأَنۡعَامِ'}, {7: 'سُورَةُ الأَعۡرَافِ'}, {8: 'سُورَةُ الأَنفَالِ'}, {9: 'سُورَةُ التَّوۡبَةِ'}, {10: 'سُورَةُ يُونُسَ'}, {11: 'سُورَةُ هُودٍ'}, {12: 'سُورَةُ يُوسُفَ'}, {13: 'سُورَةُ الرَّعۡدِ'}, {14: 'سُورَةُ إِبۡرَاهِيمَ'}, {15: 'سُورَةُ الحِجۡرِ'}, {16: 'سُورَةُ النَّحۡلِ'}, {17: 'سُورَةُ الإِسۡرَاءِ'}, {18: 'سُورَةُ الكَهۡفِ'}, {19: 'سُورَةُ مَرۡيَمَ'}, {20: 'سُورَةُ طه'}, {21: 'سُورَةُ الأَنبِيَاءِ'}, {22: 'سُورَةُ الحَجِّ'}, {23: 'سُورَةُ المُؤۡمِنُونَ'}, {24: 'سُورَةُ النُّورِ'}, {25: 'سُورَةُ الفُرۡقَانِ'}, {26: 'سُورَةُ الشُّعَرَاءِ'}, {27: 'سُورَةُ النَّمۡلِ'}, {28: 'سُورَةُ القَصَصِ'}, {29: 'سُورَةُ العَنكَبُوتِ'}, {30: 'سُورَةُ الرُّومِ'}, {31: 'سُورَةُ لُقۡمَانَ'}, {32: 'سُورَةُ السَّجۡدَةِ'}, {33: 'سُورَةُ الأَحۡزَابِ'}, {34: 'سُورَةُ سَبَإٍ'}, {35: 'سُورَةُ فَاطِرٍ'}, {36: 'سُورَةُ يسٓ'}, {37: 'سُورَةُ الصَّافَّاتِ'}, {38: 'سُورَةُ صٓ'}, {39: 'سُورَةُ الزُّمَرِ'}, {40: 'سُورَةُ غَافِرٍ'}, {41: 'سُورَةُ فُصِّلَتۡ'}, {42: 'سُورَةُ الشُّورَىٰ'}, {43: 'سُورَةُ الزُّخۡرُفِ'}, {44: 'سُورَةُ الدُّخَانِ'}, {45: 'سُورَةُ الجَاثِيَةِ'}, {46: 'سُورَةُ الأَحۡقَافِ'}, {47: 'سُورَةُ مُحَمَّدٍ'}, {48: 'سُورَةُ الفَتۡحِ'}, {49: 'سُورَةُ الحُجُرَاتِ'}, {50: 'سُورَةُ قٓ'}, {51: 'سُورَةُ الذَّارِيَاتِ'}, {52: 'سُورَةُ الطُّورِ'}, {53: 'سُورَةُ النَّجۡمِ'}, {54: 'سُورَةُ القَمَرِ'}, {55: 'سُورَةُ الرَّحۡمَٰن'}, {56: 'سُورَةُ الوَاقِعَةِ'}, {57: 'سُورَةُ الحَدِيدِ'}, {58: 'سُورَةُ المُجَادلَةِ'}, {59: 'سُورَةُ الحَشۡرِ'}, {60: 'سُورَةُ المُمۡتَحنَةِ'}, {61: 'سُورَةُ الصَّفِّ'}, {62: 'سُورَةُ الجُمُعَةِ'}, {63: 'سُورَةُ المُنَافِقُونَ'}, {64: 'سُورَةُ التَّغَابُنِ'}, {65: 'سُورَةُ الطَّلَاقِ'}, {66: 'سُورَةُ التَّحۡرِيمِ'}, {67: 'سُورَةُ المُلۡكِ'}, {68: 'سُورَةُ القَلَمِ'}, {69: 'سُورَةُ الحَاقَّةِ'}, {70: 'سُورَةُ المَعَارِجِ'}, {71: 'سُورَةُ نُوحٍ'}, {72: 'سُورَةُ الجِنِّ'}, {73: 'سُورَةُ المُزَّمِّلِ'}, {74: 'سُورَةُ المُدَّثِّرِ'}, {75: 'سُورَةُ القِيَامَةِ'}, {76: 'سُورَةُ الإِنسَانِ'}, {77: 'سُورَةُ المُرۡسَلَاتِ'}, {78: 'سُورَةُ النَّبَإِ'}, {79: 'سُورَةُ النَّازِعَاتِ'}, {80: 'سُورَةُ عَبَسَ'}, {81: 'سُورَةُ التَّكۡوِيرِ'}, {82: 'سُورَةُ الانفِطَارِ'}, {83: 'سُورَةُ المُطَفِّفِينَ'}, {84: 'سُورَةُ الانشِقَاقِ'}, {85: 'سُورَةُ البُرُوجِ'}, {86: 'سُورَةُ الطَّارِقِ'}, {87: 'سُورَةُ الأَعۡلَىٰ'}, {88: 'سُورَةُ الغَاشِيَةِ'}, {89: 'سُورَةُ الفَجۡرِ'}, {90: 'سُورَةُ البَلَدِ'}, {91: 'سُورَةُ الشَّمۡسِ'}, {92: 'سُورَةُ اللَّيۡلِ'}, {93: 'سُورَةُ الضُّحَىٰ'}, {94: 'سُورَةُ الشَّرۡحِ'}, {95: 'سُورَةُ التِّينِ'}, {96: 'سُورَةُ العَلَقِ'}, {97: 'سُورَةُ القَدۡرِ'}, {98: 'سُورَةُ البَيِّنَةِ'}, {99: 'سُورَةُ الزَّلۡزَلَةِ'}, {100: 'سُورَةُ العَادِيَاتِ'}, {101: 'سُورَةُ القَارِعَةِ'}, {102: 'سُورَةُ التَّكَاثُرِ'}, {103: 'سُورَةُ العَصۡرِ'}, {104: 'سُورَةُ الهُمَزَةِ'}, {105: 'سُورَةُ الفِيلِ'}, {106: 'سُورَةُ قُرَيۡشٍ'}, {107: 'سُورَةُ المَاعُونِ'}, {108: 'سُورَةُ الكَوۡثَرِ'}, {109: 'سُورَةُ الكَافِرُونَ'}, {110: 'سُورَةُ النَّصۡرِ'}, {111: 'سُورَةُ المَسَدِ'}, {112: 'سُورَةُ الإِخۡلَاصِ'}, {113: 'سُورَةُ الفَلَقِ'}, {114: 'سُورَةُ النَّاسِ'}]
surah_list_en =  [{1: 'Al-Faatiha'}, {2: 'Al-Baqara'}, {3: 'Aal-i-Imraan'}, {4: 'An-Nisaa'}, {5: 'Al-Maaida'}, {6: "Al-An'aam"}, {7: "Al-A'raaf"}, {8: 'Al-Anfaal'}, {9: 'At-Tawba'}, {10: 'Yunus'}, {11: 'Hud'}, {12: 'Yusuf'}, {13: "Ar-Ra'd"}, {14: 'Ibrahim'}, {15: 'Al-Hijr'}, {16: 'An-Nahl'}, {17: 'Al-Israa'}, {18: 'Al-Kahf'}, {19: 'Maryam'}, {20: 'Taa-Haa'}, {21: 'Al-Anbiyaa'}, {22: 'Al-Hajj'}, {23: 'Al-Muminoon'}, {24: 'An-Noor'}, {25: 'Al-Furqaan'}, {26: "Ash-Shu'araa"}, {27: 'An-Naml'}, {28: 'Al-Qasas'}, {29: 'Al-Ankaboot'}, {30: 'Ar-Room'}, {31: 'Luqman'}, {32: 'As-Sajda'}, {33: 'Al-Ahzaab'}, {34: 'Saba'}, {35: 'Faatir'}, {36: 'Yaseen'}, {37: 'As-Saaffaat'}, {38: 'Saad'}, {39: 'Az-Zumar'}, {40: 'Ghafir'}, {41: 'Fussilat'}, {42: 'Ash-Shura'}, {43: 'Az-Zukhruf'}, {44: 'Ad-Dukhaan'}, {45: 'Al-Jaathiya'}, {46: 'Al-Ahqaf'}, {47: 'Muhammad'}, {48: 'Al-Fath'}, {49: 'Al-Hujuraat'}, {50: 'Qaaf'}, {51: 'Adh-Dhaariyat'}, {52: 'At-Tur'}, {53: 'An-Najm'}, {54: 'Al-Qamar'}, {55: 'Ar-Rahmaan'}, {56: 'Al-Waaqia'}, {57: 'Al-Hadid'}, {58: 'Al-Mujaadila'}, {59: 'Al-Hashr'}, {60: 'Al-Mumtahana'}, {61: 'As-Saff'}, {62: "Al-Jumu'a"}, {63: 'Al-Munaafiqoon'}, {64: 'At-Taghaabun'}, {65: 'At-Talaaq'}, {66: 'At-Tahrim'}, {67: 'Al-Mulk'}, {68: 'Al-Qalam'}, {69: 'Al-Haaqqa'}, {70: "Al-Ma'aarij"}, {71: 'Nooh'}, {72: 'Al-Jinn'}, {73: 'Al-Muzzammil'}, {74: 'Al-Muddaththir'}, {75: 'Al-Qiyaama'}, {76: 'Al-Insaan'}, {77: 'Al-Mursalaat'}, {78: 'An-Naba'}, {79: "An-Naazi'aat"}, {80: 'Abasa'}, {81: 'At-Takwir'}, {82: 'Al-Infitaar'}, {83: 'Al-Mutaffifin'}, {84: 'Al-Inshiqaaq'}, {85: 'Al-Burooj'}, {86: 'At-Taariq'}, {87: "Al-A'laa"}, {88: 'Al-Ghaashiya'}, {89: 'Al-Fajr'}, {90: 'Al-Balad'}, {91: 'Ash-Shams'}, {92: 'Al-Lail'}, {93: 'Ad-Dhuhaa'}, {94: 'Ash-Sharh'}, {95: 'At-Tin'}, {96: 'Al-Alaq'}, {97: 'Al-Qadr'}, {98: 'Al-Bayyina'}, {99: 'Az-Zalzala'}, {100: 'Al-Aadiyaat'}, {101: "Al-Qaari'a"}, {102: 'At-Takaathur'}, {103: 'Al-Asr'}, {104: 'Al-Humaza'}, {105: 'Al-Fil'}, {106: 'Quraish'}, {107: "Al-Maa'un"}, {108: 'Al-Kawthar'}, {109: 'Al-Kaafiroon'}, {110: 'An-Nasr'}, {111: 'Al-Masad'}, {112: 'Al-Ikhlaas'}, {113: 'Al-Falaq'}, {114: 'An-Naas'}]


ar_surah_numbers = {
    'سُورَةُ ٱلْفَاتِحَةِ': '001',
    'سُورَةُ البَقَرَةِ': '002',
    'سُورَةُ آلِ عِمۡرَانَ': '003',
    'سُورَةُ النِّسَاءِ': '004',
    'سُورَةُ المَائـِدَةِ': '005',
    'سُورَةُ الأَنۡعَامِ': '006',
    'سُورَةُ الأَعۡرَافِ': '007',
    'سُورَةُ الأَنفَالِ': '008',
    'سُورَةُ التَّوۡبَةِ': '009',
    'سُورَةُ يُونُسَ': '010',
    'سُورَةُ هُودٍ': '011',
    'سُورَةُ يُوسُفَ': '012',
    'سُورَةُ الرَّعۡدِ': '013',
    'سُورَةُ إِبۡرَاهِيمَ': '014',
    'سُورَةُ الحِجۡرِ': '015',
    'سُورَةُ النَّحۡلِ': '016',
    'سُورَةُ الإِسۡرَاءِ': '017',
    'سُورَةُ الكَهۡفِ': '018',
    'سُورَةُ مَرۡيَمَ': '019',
    'سُورَةُ طه': '020',
    'سُورَةُ الأَنبِيَاءِ': '021',
    'سُورَةُ الحَجِّ': '022',
    'سُورَةُ المُؤۡمِنُونَ': '023',
    'سُورَةُ النُّورِ': '024',
    'سُورَةُ الفُرۡقَانِ': '025',
    'سُورَةُ الشُّعَرَاءِ': '026',
    'سُورَةُ النَّمۡلِ': '027',
    'سُورَةُ القَصَصِ': '028',
    'سُورَةُ العَنكَبُوتِ': '029',
    'سُورَةُ الرُّومِ': '030',
    'سُورَةُ لُقۡمَانَ': '031',
    'سُورَةُ السَّجۡدَةِ': '032',
    'سُورَةُ الأَحۡزَابِ': '033',
    'سُورَةُ سَبَإٍ': '034',
    'سُورَةُ فَاطِرٍ': '035',
    'سُورَةُ يسٓ': '036',
    'سُورَةُ الصَّافَّاتِ': '037',
    'سُورَةُ صٓ': '038',
    'سُورَةُ الزُّمَرِ': '039',
    'سُورَةُ غَافِرٍ': '040',
    'سُورَةُ فُصِّلَتۡ': '041',
    'سُورَةُ الشُّورَىٰ': '042',
    'سُورَةُ الزُّخۡرُفِ': '043',
    'سُورَةُ الدُّخَانِ': '044',
    'سُورَةُ الجَاثِيَةِ': '045',
    'سُورَةُ الأَحۡقَافِ': '046',
    'سُورَةُ مُحَمَّدٍ': '047',
    'سُورَةُ الفَتۡحِ': '048',
    'سُورَةُ الحُجُرَاتِ': '049',
    'سُورَةُ قٓ': '050',
    'سُورَةُ الذَّارِيَاتِ': '051',
    'سُورَةُ الطُّورِ': '052',
    'سُورَةُ النَّجۡمِ': '053',
    'سُورَةُ القَمَرِ': '054',
    'سُورَةُ الرَّحۡمَٰن': '055',
    'سُورَةُ الوَاقِعَةِ': '056',
    'سُورَةُ الحَدِيدِ': '057',
    'سُورَةُ المُجَادلَةِ': '058',
    'سُورَةُ الحَشۡرِ' : '059',
    'سُورَةُ المُمۡتَحنَةِ' : '060',
    'سُورَةُ الصَّفِّ' : '061',
    'سُورَةُ الجُمُعَةِ' : '062',
    'سُورَةُ المُنَافِقُونَ' : '063',
    'سُورَةُ التَّغَابُنِ' : '064',
    'سُورَةُ الطَّلَاقِ' : '065',
    'سُورَةُ التَّحۡرِيمِ' : '066',
    'سُورَةُ المُلۡكِ' : '067',
    'سُورَةُ القَلَمِ' : '068',
    'سُورَةُ الحَاقَّةِ' : '069',
    'سُورَةُ المَعَارِجِ' : '070',
    'سُورَةُ نُوحٍ' : '071',
    'سُورَةُ الجِنِّ' : '072',
    'سُورَةُ المُزَّمِّلِ' : '073',
    'سُورَةُ المُدَّثِّرِ' : '074',
    'سُورَةُ القِيَامَةِ' : '075',
    'سُورَةُ الإِنسَانِ' : '076',
    'سُورَةُ المُرۡسَلَاتِ' : '077',
    'سُورَةُ النَّبَإِ' : '078',
    'سُورَةُ النَّازِعَاتِ' : '079',
    'سُورَةُ عَبَسَ' : '080',
    'سُورَةُ التَّكۡوِيرِ' : '081',
    'سُورَةُ الانفِطَارِ' : '082',
    'سُورَةُ المُطَفِّفِينَ' : '083',
    'سُورَةُ الانشِقَاقِ' : '084',
    'سُورَةُ البُرُوجِ' : '085',
    'سُورَةُ الطَّارِقِ' : '086',
    'سُورَةُ الأَعۡلَىٰ' : '087',
    'سُورَةُ الغَاشِيَةِ' : '088',
    'سُورَةُ الفَجۡرِ' : '089',
    'سُورَةُ البَلَدِ' : '090',
    'سُورَةُ الشَّمۡسِ' : '091',
    'سُورَةُ اللَّيۡلِ' : '092',
    'سُورَةُ الضُّحَىٰ' : '093',
    'سُورَةُ الشَّرۡحِ' : '094',
    'سُورَةُ التِّينِ' : '095',
    'سُورَةُ العَلَقِ' : '096',
    'سُورَةُ القَدۡرِ' : '097',
    'سُورَةُ البَيِّنَةِ' : '098',
    'سُورَةُ الزَّلۡزَلَةِ' : '099',
    'سُورَةُ العَادِيَاتِ' : '100',
    'سُورَةُ القَارِعَةِ' : '101',
    'سُورَةُ التَّكَاثُرِ' : '102',
    'سُورَةُ العَصۡرِ' : '103',
    'سُورَةُ الهُمَزَةِ' : '104',
    'سُورَةُ الفِيلِ' : '105',
    'سُورَةُ قُرَيۡشٍ' : '106',
    'سُورَةُ المَاعُونِ' : '107',
    'سُورَةُ الكَوۡثَرِ' : '108',
    'سُورَةُ الكَافِرُونَ' : '109',
    'سُورَةُ النَّصۡرِ' : '110',
    'سُورَةُ المَسَدِ' : '111',
    'سُورَةُ الإِخۡلَاصِ' : '112',
    'سُورَةُ الفَلَقِ' : '113',
    'سُورَةُ النَّاسِ' : '114'
}



shaikh_list = ['عبدالباسط عبدالصمد','عبدالرحمن السديس','محمود الحصري', 'علي الحذيفي','محمد المنشاوي','ابراهيم الأخضر','ياسر الدوسري','عبدالله الجهني','سعد الغامدي','بندر بليلة','عبدالله بصفر','عبدالله خياط','عبدالولي الأركاني','أحمد الحذيفي','علي جابر','هزاع البلوشي','ادريس أبكر','خالد الجليل','ناصر القطامي','صالح آل طالب']

surah_list = [
    'سُورَةُ ٱلْفَاتِحَةِ', 'سُورَةُ البَقَرَةِ', 'سُورَةُ آلِ عِمۡرَانَ', 
    'سُورَةُ المَائـِدَةِ', 'سُورَةُ الأَنۡعَامِ', 'سُورَةُ الأَعۡرَافِ',
    'سُورَةُ التَّوۡبَةِ', 'سُورَةُ يُونُسَ', 'سُورَةُ هُودٍ',
    'سُورَةُ الرَّعۡدِ', 'سُورَةُ إِبۡرَاهِيمَ', 'سُورَةُ الحِجۡرِ', 
    'سُورَةُ الإِسۡرَاءِ', 'سُورَةُ الكَهۡفِ', 'سُورَةُ مَرۡيَمَ', 
    'سُورَةُ الأَنبِيَاءِ', 'سُورَةُ الحَجِّ', 'سُورَةُ المُؤۡمِنُونَ', 
    'سُورَةُ الفُرۡقَانِ', 'سُورَةُ الشُّعَرَاءِ', 'سُورَةُ النَّمۡلِ', 
    'سُورَةُ العَنكَبُوتِ', 'سُورَةُ الرُّومِ', 'سُورَةُ لُقۡمَانَ', 
    'سُورَةُ الأَحۡزَابِ', 'سُورَةُ سَبَإٍ', 'سُورَةُ فَاطِرٍ', 
    'سُورَةُ الصَّافَّاتِ', 'سُورَةُ صٓ', 'سُورَةُ الزُّمَرِ', 
    'سُورَةُ فُصِّلَتۡ', 'سُورَةُ الشُّورَىٰ', 'سُورَةُ الزُّخۡرُفِ', 
    'سُورَةُ الجَاثِيَةِ', 'سُورَةُ الأَحۡقَافِ', 'سُورَةُ مُحَمَّدٍ', 
    'سُورَةُ الحُجُرَاتِ', 'سُورَةُ قٓ', 'سُورَةُ الذَّارِيَاتِ', 
    'سُورَةُ النَّجۡمِ', 'سُورَةُ القَمَرِ', 'سُورَةُ الرَّحۡمَٰن', 
    'سُورَةُ الحَدِيدِ', 'سُورَةُ المُجَادلَةِ', 'سُورَةُ الحَشۡرِ', 
    'سُورَةُ الصَّفِّ', 'سُورَةُ الجُمُعَةِ', 'سُورَةُ المُنَافِقُونَ', 
    'سُورَةُ الطَّلَاقِ', 'سُورَةُ التَّحۡرِيمِ', 'سُورَةُ المُلۡكِ', 
    'سُورَةُ الحَاقَّةِ', 'سُورَةُ المَعَارِجِ', 'سُورَةُ نُوحٍ', 
    'سُورَةُ المُزَّمِّلِ', 'سُورَةُ المُدَّثِّرِ', 'سُورَةُ القِيَامَةِ', 
    'سُورَةُ المُرۡسَلَاتِ', 'سُورَةُ النَّبَإِ', 'سُورَةُ النَّازِعَاتِ', 
    'سُورَةُ التَّكۡوِيرِ', 'سُورَةُ الانفِطَارِ', 'سُورَةُ المُطَفِّفِينَ', 
    'سُورَةُ البُرُوجِ', 'سُورَةُ الطَّارِقِ', 'سُورَةُ الأَعۡلَىٰ', 
    'سُورَةُ الفَجۡرِ', 'سُورَةُ البَلَدِ', 'سُورَةُ الشَّمۡسِ', 
    'سُورَةُ الضُّحَىٰ', 'سُورَةُ الشَّرۡحِ', 'سُورَةُ التِّينِ', 
    'سُورَةُ القَدۡرِ', 'سُورَةُ البَيِّنَةِ', 'سُورَةُ الزَّلۡزَلَةِ', 
    'سُورَةُ القَارِعَةِ', 'سُورَةُ التَّكَاثُرِ', 'سُورَةُ العَصۡرِ', 
    'سُورَةُ الفِيلِ', 'سُورَةُ قُرَيۡشٍ', 'سُورَةُ المَاعُونِ', 
    'سُورَةُ الكَافِرُونَ', 'سُورَةُ النَّصۡرِ', 'سُورَةُ المَسَدِ',
    'سُورَةُ الإخلاص', 'سُورَةُ الفلق', 'سُورَةُ الناس'
]


# ----- Get surah_keyboard_ar -----
# def get_surah_keyboard_ar():
#     surah_list_en = []
#     count = 0
#     for item in surah_list_ar:
#         value = item.values()
#         print('value = ', value)
#         if count == 0:
#             s1 = value
#             count+=1

#         elif count == 1:
#             s2 = value
#             count+=1
#         elif count == 2:
#             s3 = value
#             count+=1
#         else:
#             surah_keyboard_ar.append([[s1],[s2],[s3]])
#             count=0
#         print('--- count = ', count)
#     print('surah_keyboard_ar = ', surah_keyboard_ar)

surah_keyboard_ar = [
    ['سُورَةُ ٱلْفَاتِحَةِ', 'سُورَةُ البَقَرَةِ', 'سُورَةُ آلِ عِمۡرَانَ'], 
    ['سُورَةُ المَائـِدَةِ', 'سُورَةُ الأَنۡعَامِ', 'سُورَةُ الأَعۡرَافِ'],
    ['سُورَةُ التَّوۡبَةِ', 'سُورَةُ يُونُسَ', 'سُورَةُ هُودٍ'],
    ['سُورَةُ الرَّعۡدِ', 'سُورَةُ إِبۡرَاهِيمَ', 'سُورَةُ الحِجۡرِ'], 
    ['سُورَةُ الإِسۡرَاءِ', 'سُورَةُ الكَهۡفِ', 'سُورَةُ مَرۡيَمَ'], 
    ['سُورَةُ الأَنبِيَاءِ', 'سُورَةُ الحَجِّ', 'سُورَةُ المُؤۡمِنُونَ'], 
    ['سُورَةُ الفُرۡقَانِ', 'سُورَةُ الشُّعَرَاءِ', 'سُورَةُ النَّمۡلِ'], 
    ['سُورَةُ العَنكَبُوتِ', 'سُورَةُ الرُّومِ', 'سُورَةُ لُقۡمَانَ'], 
    ['سُورَةُ الأَحۡزَابِ', 'سُورَةُ سَبَإٍ', 'سُورَةُ فَاطِرٍ'], 
    ['سُورَةُ الصَّافَّاتِ', 'سُورَةُ صٓ', 'سُورَةُ الزُّمَرِ'], 
    ['سُورَةُ فُصِّلَتۡ', 'سُورَةُ الشُّورَىٰ', 'سُورَةُ الزُّخۡرُفِ'], 
    ['سُورَةُ الجَاثِيَةِ', 'سُورَةُ الأَحۡقَافِ', 'سُورَةُ مُحَمَّدٍ'], 
    ['سُورَةُ الحُجُرَاتِ', 'سُورَةُ قٓ', 'سُورَةُ الذَّارِيَاتِ'], 
    ['سُورَةُ النَّجۡمِ', 'سُورَةُ القَمَرِ', 'سُورَةُ الرَّحۡمَٰن'], 
    ['سُورَةُ الحَدِيدِ', 'سُورَةُ المُجَادلَةِ', 'سُورَةُ الحَشۡرِ'], 
    ['سُورَةُ الصَّفِّ', 'سُورَةُ الجُمُعَةِ', 'سُورَةُ المُنَافِقُونَ'], 
    ['سُورَةُ الطَّلَاقِ', 'سُورَةُ التَّحۡرِيمِ', 'سُورَةُ المُلۡكِ'], 
    ['سُورَةُ الحَاقَّةِ', 'سُورَةُ المَعَارِجِ', 'سُورَةُ نُوحٍ'], 
    ['سُورَةُ المُزَّمِّلِ', 'سُورَةُ المُدَّثِّرِ', 'سُورَةُ القِيَامَةِ'], 
    ['سُورَةُ المُرۡسَلَاتِ', 'سُورَةُ النَّبَإِ', 'سُورَةُ النَّازِعَاتِ'], 
    ['سُورَةُ التَّكۡوِيرِ', 'سُورَةُ الانفِطَارِ', 'سُورَةُ المُطَفِّفِينَ'], 
    ['سُورَةُ البُرُوجِ', 'سُورَةُ الطَّارِقِ', 'سُورَةُ الأَعۡلَىٰ'], 
    ['سُورَةُ الفَجۡرِ', 'سُورَةُ البَلَدِ', 'سُورَةُ الشَّمۡسِ'], 
    ['سُورَةُ الضُّحَىٰ', 'سُورَةُ الشَّرۡحِ', 'سُورَةُ التِّينِ'], 
    ['سُورَةُ القَدۡرِ', 'سُورَةُ البَيِّنَةِ', 'سُورَةُ الزَّلۡزَلَةِ'], 
    ['سُورَةُ القَارِعَةِ', 'سُورَةُ التَّكَاثُرِ', 'سُورَةُ العَصۡرِ'], 
    ['سُورَةُ الفِيلِ', 'سُورَةُ قُرَيۡشٍ', 'سُورَةُ المَاعُونِ'], 
    ['سُورَةُ الكَافِرُونَ', 'سُورَةُ النَّصۡرِ', 'سُورَةُ المَسَدِ'],
    ['سُورَةُ الإخلاص', 'سُورَةُ الفلق', 'سُورَةُ الناس'],
    ]


# ----- Get get_surah_keyboard_en -----
# def get_surah_keyboard_en():
#     surah_keyboard_en = []
#     count = 0
#     for item in surah_list_en:
#         value = item.values()
#         print('value = ', value)
#         if count == 0:
#             s1 = value
#             count+=1
#         elif count == 1:
#             s2 = value
#             count+=1
#         elif count == 2:
#             s3 = value
#             count+=1
#         else:

#             surah_keyboard_en.append([[s1],[s2],[s3]])
#             count=0
#         print('--- count = ', count)
#     print('surah_keyboard_en = ', surah_keyboard_en)

surah_keyboard_en =  [
    [['Al-Faatiha'], ['Al-Baqara'], ['Aal-i-Imraan']], 
    [['Al-Maaida'], ["Al-An'aam"], ["Al-A'raaf"]], 
    [['At-Tawba'], ['Yunus'], ['Hud']], 
    [["Ar-Ra'd"], ['Ibrahim'], ['Al-Hijr']], 
    [['Al-Israa'], ['Al-Kahf'], ['Maryam']], 
    [['Al-Anbiyaa'], ['Al-Hajj'], ['Al-Muminoon']], 
    [['Al-Furqaan'], ["Ash-Shu'araa"], ['An-Naml']], 
    [['Al-Ankaboot'], ['Ar-Room'], ['Luqman']], 
    [['Al-Ahzaab'], ['Saba'], ['Faatir']], 
    [['As-Saaffaat'], ['Saad'], ['Az-Zumar']], 
    [['Fussilat'], ['Ash-Shura'], ['Az-Zukhruf']], 
    [['Al-Jaathiya'], ['Al-Ahqaf'], ['Muhammad']], 
    [['Al-Hujuraat'], ['Qaaf'], ['Adh-Dhaariyat']], 
    [['An-Najm'], ['Al-Qamar'], ['Ar-Rahmaan']], 
    [['Al-Hadid'], ['Al-Mujaadila'], ['Al-Hashr']], 
    [['As-Saff'], ["Al-Jumu'a"], ['Al-Munaafiqoon']], 
    [['At-Talaaq'], ['At-Tahrim'], ['Al-Mulk']], 
    [['Al-Haaqqa'], ["Al-Ma'aarij"], ['Nooh']], 
    [['Al-Muzzammil'], ['Al-Muddaththir'], ['Al-Qiyaama']], 
    [['Al-Mursalaat'], ['An-Naba'], ["An-Naazi'aat"]], 
    [['At-Takwir'], ['Al-Infitaar'], ['Al-Mutaffifin']], 
    [['Al-Burooj'], ['At-Taariq'], ["Al-A'laa"]], 
    [['Al-Fajr'], ['Al-Balad'], ['Ash-Shams']], 
    [['Ad-Dhuhaa'], ['Ash-Sharh'], ['At-Tin']], 
    [['Al-Qadr'], ['Al-Bayyina'], ['Az-Zalzala']], 
    [["Al-Qaari'a"], ['At-Takaathur'], ['Al-Asr']], 
    [['Al-Fil'], ['Quraish'], ["Al-Maa'un"]], 
    [['Al-Kaafiroon'], ['An-Nasr'], ['Al-Masad']]
    ]


shaikh_list_ar = {
    'عبدالباسط عبدالصمد' : 'basit',
    'عبدالرحمن السديس' : 'sds',
    'محمود الحصري' : 'husr',
    'علي الحذيفي' : 'hthfi',
    'محمد المنشاوي' : 'minsh',
    'ابراهيم الأخضر' : 'akdr',
    'ياسر الدوسري' : 'yasser',
    'عبدالله الجهني' : 'jhn',
    'سعد الغامدي' : 's_gmd',
    'بندر بليلة' : 'balilah',
    'عبدالله بصفر' : 'bsfr',
    'عبدالله خياط' : 'kyat',
    'عبدالولي الأركاني' : 'arkani',
    'أحمد الحذيفي' : 'ahmad_huth',
    'علي جابر' : 'a_jbr',
    'هزاع البلوشي' : 'hazza',
    'ادريس أبكر' : 'abkr',
    'خالد الجليل' : 'jleel',
    'ناصر القطامي' : 'qtm',
    'صالح آل طالب' : 'tlb'
}
     
def get_exact_shaikh_name(ar_shaikh_name):
    if ar_shaikh_name == 'عبدالباسط عبدالصمد':
        return 'basit'
    elif ar_shaikh_name == 'عبدالرحمن السديس':
        return 'sds'
    elif ar_shaikh_name == 'محمود الحصري':
        return 'husr'
    elif ar_shaikh_name == 'محمد المنشاوي':
        return 'minsh'
    elif ar_shaikh_name == 'ابراهيم الأخضر':
        return 'akdr'
    elif ar_shaikh_name == 'ياسر الدوسري':
        return 'yasser'
    elif ar_shaikh_name == 'عبدالله الجهني':
        return 'jhn'
    elif ar_shaikh_name == 'سعد الغامدي':
        return 's_gmd'
    elif ar_shaikh_name == 'بندر بليلة':
        return 'balilah'
    elif ar_shaikh_name == 'عبدالله بصفر':
        return 'bsfr'
    elif ar_shaikh_name == 'عبدالله خياط':
        return 'kyat'
    elif ar_shaikh_name == 'عبدالولي الأركاني':
        return 'arkani'
    elif ar_shaikh_name == 'أحمد الحذيفي':
        return 'ahmad_huth'
    elif ar_shaikh_name == 'علي جابر':
        return 'a_jbr'
    elif ar_shaikh_name == 'هزاع البلوشي':
        return 'hazza'
    elif ar_shaikh_name == 'ادريس أبكر':
        return 'abkr'
    elif ar_shaikh_name == 'خالد الجليل':
        return 'jleel'
    elif ar_shaikh_name == 'ناصر القطامي':
        return 'qtm'
    elif ar_shaikh_name == 'صالح آل طالب':
        return 'tlb'





def get_server_num(ar_shaikh_name):
    if ar_shaikh_name == 'عبدالباسط عبدالصمد':
        return 'server7'
    elif ar_shaikh_name == 'عبدالرحمن السديس':
        return 'server11'
    elif ar_shaikh_name == 'محمود الحصري':
        return 'server13'
    elif ar_shaikh_name == 'محمد المنشاوي':
        return 'server10'
    elif ar_shaikh_name == 'ابراهيم الأخضر':
        return 'server6'
    elif ar_shaikh_name == 'ياسر الدوسري':
        return 'server11'
    elif ar_shaikh_name == 'عبدالله الجهني':
        return 'server13'
    elif ar_shaikh_name == 'سعد الغامدي':
        return 'server7'
    elif ar_shaikh_name == 'بندر بليلة':
        return 'server6'
    elif ar_shaikh_name == 'عبدالله بصفر':
        return 'server6'
    elif ar_shaikh_name == 'عبدالله خياط':
        return 'server12'
    elif ar_shaikh_name == 'عبدالولي الأركاني':
        return 'server6'
    elif ar_shaikh_name == 'أحمد الحذيفي':
        return 'server8'
    elif ar_shaikh_name == 'علي جابر':
        return 'server11'
    elif ar_shaikh_name == 'هزاع البلوشي':
        return 'server11'
    elif ar_shaikh_name == 'ادريس أبكر':
        return 'server6'
    elif ar_shaikh_name == 'خالد الجليل':
        return 'server10'
    elif ar_shaikh_name == 'ناصر القطامي':
        return 'server6'
    elif ar_shaikh_name == 'صالح آل طالب':
        return 'server9'



available_surah = [
    {'basit':[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'sds': [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'husr': [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'hthfi': [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'minsh': [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'akdr': [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'yasser': [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'jhn':[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'s_gmd': [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'balilah': [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'bsfr':[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'kyat': [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'arkani': [1,2,3,7,12,14,15,16,17,18,19,20,31,36,37,39,40,49,55,56,67,68,69,70,71,72,73,74,75,76,77]},
    {'ahmad_huth': [1,14,15,17,18,19,21,22,23,26,27,29,32,35,38,44,45,49,50,55,56,57,62,63,64,65,66,72,73,74,75,76,77,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'a_jbr': [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'hazza': [1,13,14,15,18,19,31,36,37,38,42,44,47,49,50,51,52,53,54,55,56,57,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'abkr': [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'jleel': [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'qtm': [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114]},
    {'tlb': [1,25,34,38,39,44,45,46,47,55,56,57,58,59,60,61,70,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86]}
]

shaikh_list_en = {
    'Abdulbasit Abdulsamad':'basit',
    'Abdulrahman Alsudaes':'sds',
    'Mahmoud Al-Hussary':'husr',
    'Ali Alhuthaifi':'hthfi',
    'Mohammed Al-Minshawi':'minsh',
    'Ibrahim Al-Akdar':'akdr',
    'Yasser Al-Dosari':'yasser',
    'Abdullah Al-Johany':'jhn',
    'Saad Al-Ghamdi':'s_gmd',
    'Bandar Balilah':'balilah',
    'Abdullah Basfer':'bsfr',
    'Abdullah Khayyat':'kyat',
    'Abdulwali Al-Arkani':'arkani',
    'Ahmad Alhuthaifi':'ahmad_huth',
    'Ali Jaber':'a_jbr',
    'Hazza Al-Balushi':'hazza',
    'Idrees Abkr':'abkr',
    'Khalid Al-Jileel':'jleel',
    'Nasser Alqatami':'qtm',
    'Saleh Al-Talib':'tlb'
}

shaikh_keyboard_ar = [
    ['الرجوع إلى قائمة السور'],
    ['عبدالباسط عبدالصمد','عبدالرحمن السديس'],
    ['محمود الحصري', 'علي الحذيفي'],
    ['محمد المنشاوي','ابراهيم الأخضر'],
    ['ياسر الدوسري','عبدالله الجهني'],
    ['سعد الغامدي','بندر بليلة'],
    ['عبدالله بصفر','عبدالله خياط'],
    ['عبدالولي الأركاني','أحمد الحذيفي'],
    ['علي جابر','هزاع البلوشي'],
    ['ادريس أبكر','خالد الجليل'],
    ['ناصر القطامي','صالح آل طالب']
]

shaikh_keyboard_en = [
    ['Abdulbasit Abdulsamad','Abdulrahman Alsudaes'],
    ['Mahmoud Al-Hussary','Ali Alhuthaifi'],
    ['Mohammed Al-Minshawi','Ibrahim Al-Akdar'],
    ['Yasser Al-Dosari','Abdullah Al-Johany'],
    ['Saad Al-Ghamdi','Bandar Balilah'],
    ['Abdullah Basfer','Abdullah Khayyat'],
    ['Abdulwali Al-Arkani','Ahmad Alhuthaifi'],
    ['Ali Jaber','Hazza Al-Balushi'],
    ['Idrees Abkr','Khalid Al-Jileel'],
    ['Nasser Alqatami','Saleh Al-Talib']
]